# SetValue Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..SetValue Method (String)
ScheduleFilter Class See Also
---
Set the filter value to a string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetValue(
	string string
)
```

Visual Basic
---
```text
Public Sub SetValue ( _
	string As String _
)
```

Visual C++
---
```text
public:
void SetValue(
	String^ string
)
```

# ### Parameters
string
    Type: System..::..String The filter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace